app/Controllers/Home.php

SELECT *
FROM `user_role`
WHERE `role_id` = '1'
 LIMIT 1
---
                    else
                    {
                        $roleModel = new \App\Models\roleModel();
                        $role = $roleModel->WHERE('role_id',$account['role_id'])->first();

SELECT COUNT(*) AS `numrows`
FROM `accounts`
---
    public function fetchAccount()
    {
        $accountModel = new \App\Models\accountModel();
        $searchTerm = $_GET['search']['value'] ?? '';
        $builder = $this->db->table('accounts a');
        $builder->select('a.*,b.role_name');
        $builder->join('user_role b', 'b.role_id = a.role_id', 'LEFT');
        $builder->groupBy('a.account_id');

        // Apply search filter if a search term exists
        if ($searchTerm) {
            // Add a LIKE condition to filter based on school name or address or any other column you wish to search
            $builder->groupStart()
                    ->like('a.fullname', $searchTerm)
                    ->orLike('a.email', $searchTerm)
                    ->orLike('b.role_name', $searchTerm)
                    ->groupEnd();
        }

        // Execute the query and fetch the results
        $account = $builder->get()->getResult();

INSERT INTO `logs` (`account_id`, `activities`, `page`, `datetime`) VALUES ('3', 'Update the course of Bachelor of Science In Information Technology', 'Settings', '2025-04-13 10:32:22 pm')
---
                    'page'=>'Settings',
                    'datetime'=>date('Y-m-d h:i:s a')
                    ];
            $logModel->save($data);