app/Controllers/Home.php

    public function checkAuth()
    {
        $validation = $this->validate([
            'csrf_deped'=>'required',
            'email'=>'required|valid_email|is_not_unique[accounts.email]',
            'password'=>'required|min_length[8]|max_length[12]|regex_match[/[A-Z]/]|regex_match[/[a-z]/]|regex_match[/[0-9]/]'
        ]);
        if(!$validation)
        {
            return view('auth/login',['validation'=>$this->validator]);
        }
        else
        {
            if ($this->isLockedOut()) {
                session()->setFlashdata('fail','Too many login attempts. Please try again later.');
                return redirect()->to('/auth')->withInput();
            }
            else
            {
                $accountModel = new \App\Models\accountModel();
                $account = $accountModel->WHERE('email',$this->request->getPost('email'))
                                        ->WHERE('verified',1)->WHERE('status',1)
                                        ->first();
---
SELECT *
FROM `accounts`
WHERE `email` = 'vinmogate@gmail.com'
AND `verified` = 1
AND `status` = 1
 LIMIT 1

                                'page'=>'Login page',
                                'datetime'=>date('Y-m-d h:i:s a')
                                ];
                        $logModel->save($data);
---
INSERT INTO `logs` (`account_id`, `activities`, `page`, `datetime`) VALUES ('3', 'Logged On', 'Login page', '2025-04-14 12:43:05 pm')

    public function logout()
    {
        //logs
        date_default_timezone_set('Asia/Manila');
        $logModel = new \App\Models\logModel();
        $data = ['account_id'=>session()->get('loggedUser'),
                'activities'=>'Logged Out',
                'page'=>'Logout page',
                'datetime'=>date('Y-m-d h:i:s a')
            ];
        $logModel->save($data);
---
INSERT INTO `logs` (`account_id`, `activities`, `page`, `datetime`) VALUES ('1', 'Logged Out', 'Logout page', '2025-04-11 02:46:21 pm')

    public function fetchAccount()
    {
        $accountModel = new \App\Models\accountModel();
        $searchTerm = $_GET['search']['value'] ?? '';
        $builder = $this->db->table('accounts a');
        $builder->select('a.*,b.role_name');
        $builder->join('user_role b', 'b.role_id = a.role_id', 'LEFT');
        $builder->groupBy('a.account_id');

        // Apply search filter if a search term exists
        if ($searchTerm) {
            // Add a LIKE condition to filter based on school name or address or any other column you wish to search
            $builder->groupStart()
                    ->like('a.fullname', $searchTerm)
                    ->orLike('a.email', $searchTerm)
                    ->orLike('b.role_name', $searchTerm)
                    ->groupEnd();
        }

        // Execute the query and fetch the results
        $account = $builder->get()->getResult();
---
SELECT `a`.*, `b`.`role_name`
FROM `accounts` `a`
LEFT JOIN `user_role` `b` ON `b`.`role_id` = `a`.`role_id`
GROUP BY `a`.`account_id`
SELECT COUNT(*) AS `numrows`
FROM `accounts`

    public function createAccount()
    {
        $title = "Create Account";
        //role
        $roleModel = new \App\Models\roleModel();
        $role = $roleModel->findAll();
        //office
        $officeModel = new \App\Models\officeModel();
        $office = $officeModel->findAll();
        //recent
        $accountModel = new \App\Models\accountModel();
        $recentAccount = $accountModel->orderBy('account_id','DESC')->limit(5)->findAll();
---
SELECT *
FROM `user_role`
SELECT *
FROM `accounts`
ORDER BY `account_id` DESC
 LIMIT 5

    public function editAccount($id)
    {
        $title = "Edit Account";
        //role
        $roleModel = new \App\Models\roleModel();
        $role = $roleModel->findAll();
---
SELECT *
FROM `user_role`

    public function modifyAccount()
    {
        $accountModel = new \App\Models\accountModel();
        $validation = $this->validate([
            'csrf_deped'=>'required',
            'fullname'=>'required',
            'email'=>'required|valid_email',
            'role'=>'required',
            'office'=>'required'
        ]);

        if(!$validation)
        {
            return $this->response->SetJSON(['error' => $this->validator->getErrors()]);
        }
        else
        {
            $id = $this->request->getPost('account_id');
            $data = ['role_id'=>$this->request->getPost('role'),
                    'school_id'=>$this->request->getPost('office'),
                    'email'=>$this->request->getPost('email'),
                    'fullname'=>$this->request->getPost('fullname'),
                    'status'=>$this->request->getPost('status'),
                    'verified'=>$this->request->getPost('verified'),];
            $accountModel->update($id,$data);
            //logs
            date_default_timezone_set('Asia/Manila');
            $logModel = new \App\Models\logModel();
            $data = ['account_id'=>session()->get('loggedUser'),
                    'activities'=>'Modify the account of '.$this->request->getPost('fullname'),
                    'page'=>'Edit Account',
                    'datetime'=>date('Y-m-d h:i:s a')
                    ];
---
SELECT COUNT(*) AS `numrows`
FROM `user_role`
SELECT *
FROM `user_role`

    public function verifyAccount($id)
    {
        $accountModel = new \App\Models\accountModel();
        $account = $accountModel->WHERE('Token',$id)->WHERE('status',1)->first();
        $values = ['verified'=>1];
        $accountModel->update($account['account_id'],$values);
---
UPDATE `accounts` SET `password` = '$2y$10$bdiKdTPQBr1hV2533t0rBu4H62d67.mvQSwAvEb1VQr.gm2AzOSoO'
WHERE `accounts`.`account_id` IN ('3')

    public function resetAccount()
    {
        $accountModel = new \App\Models\accountModel();
        $passwordModel = new \App\Models\passwordModel();
        $password = $passwordModel->first();
        $val = $this->request->getPost('value');
        $data = ['password'=>$password['password']];
        $accountModel->update($val,$data);
        //logs
        date_default_timezone_set('Asia/Manila');
        $logModel = new \App\Models\logModel();
        $data = ['account_id'=>session()->get('loggedUser'),
                'activities'=>'Reset account password',
                'page'=>'Manage Account',
                'datetime'=>date('Y-m-d h:i:s a')
                ];
        $logModel->save($data);
---
INSERT INTO `logs` (`account_id`, `activities`, `page`, `datetime`) VALUES ('1', 'Reset account password', 'Manage Account', '2025-04-12 11:42:15 am')

    public function settings()
    {
        $title = "Settings";
        //logs
        $builder = $this->db->table('logs a');
        $builder->select('a.*,b.fullname');
        $builder->join('accounts b','b.account_id=a.account_id','LEFT');
        $logs = $builder->get()->getResult();
---
SELECT `a`.*, `b`.`fullname`
FROM `logs` `a`
LEFT JOIN `accounts` `b` ON `b`.`account_id`=`a`.`account_id`