app/Controllers/Job.php

SELECT *
FROM `training_points`
SELECT COUNT(*) AS `numrows`
FROM `training_points`
SELECT COUNT(*) AS `numrows`
FROM `training_points`
WHERE `from` LIKE '%%' ESCAPE '!'
OR  `to` LIKE '%%' ESCAPE '!'
---
    public function fetchTrainingData()
    {
        $trainingPointModel = new \App\Models\trainingPointModel();
        $searchTerm = $_GET['search']['value'] ?? '';
        if ($searchTerm) {
            $trainingPointModel->like('from', $searchTerm)
                                ->orlike('to', $searchTerm);
        }

        $training = $trainingPointModel->findAll();

        $totalRecords = $trainingPointModel->countAllResults();

        $trainingPointModel->like('from', $searchTerm)
                            ->orlike('to', $searchTerm);
        $totalFiltered = $trainingPointModel->countAllResults();